xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
            }
            return;
        default:
            return;
    }
}

void
xi_publish_file_info(xi_context_handle_t in_context_handle)
{
    unsigned char encoded[512];
    ssize_t enc_sz;

    //xi_parse_file_update_available(NULL);

    /* Let's try making a XI_FILE_INFO packet */
    cn_cbor_errback err;
    cn_cbor *cb_map = cn_cbor_map_create(&err);

    cn_cbor_map_put(cb_map,
                    cn_cbor_string_create("msgtype", &err),
                    cn_cbor_int_create(XI_FILE_INFO, &err),
                    &err);

    cn_cbor_map_put(cb_map,
                    cn_cbor_string_create("msgver", &err),
                    cn_cbor_int_create(1, &err),
                    &err);


    cn_cbor *a = cn_cbor_array_create(&err);
    cn_cbor *cb_file1 = cn_cbor_map_create(&err);

    cn_cbor_map_put(cb_file1,
                    cn_cbor_string_create("N", &err),
                    cn_cbor_string_create(filename, &err),
                    &err);
    cn_cbor_map_put(cb_file1,
                    cn_cbor_string_create("R", &err),
                    cn_cbor_string_create("-1", &err),
                    &err);

    cn_cbor_array_append(a, cb_file1, &err);

    cn_cbor_map_put(cb_map,
                    cn_cbor_string_create("list", &err),
                    a,
                    &err);

    enc_sz = cn_cbor_encoder_write(encoded, 0, sizeof(encoded), cb_map);

    cn_cbor_free(cb_map CBOR_CONTEXT_PARAM);

    /* publish the FILE_INFO message */
    xi_publish_data( in_context_handle, xi_stopic, encoded, enc_sz, XI_MQTT_QOS_AT_MOST_ONCE,
               XI_MQTT_RETAIN_FALSE, NULL, NULL );
    printf("Published FILE_INFO to %s\n",xi_stopic);
    snprintf( message,sizeof(message),"File info" );
    snprintf( details,sizeof(details), "name=%s revision=%s", filename, file_current_revision );
    snprintf( buffer,sizeof(buffer),"{\"message\":\"%s\",\"severity\":\"notice\",\"details\":\"%s\"}",message,details );
    xi_publish( in_context_handle, xi_logtopic, buffer, XI_MQTT_QOS_AT_MOST_ONCE, XI_MQTT_RETAIN_FALSE, NULL, NULL );
    downloading = 0;
    sl_extlib_FlcCloseFile(download_context.file_token, NULL, NULL, 0);
}


void xi_parse_file_update_available(cn_cbor *cb)
{
    cn_cbor *cb_list;
    cn_cbor *cb_item;
    cn_cbor *cb_file;
    int filelistlength = 0;
    int i,index;

    //
    // Zero out download_context
    //
    memset( &download_context, 0, sizeof( file_download_ctx_t ) );

    cb_item = cn_cbor_mapget_string(cb, "msgver");
    if(cb_item) {
        printf("FILE_UPDATE_AVAILABLE: msgver = %d\n",cb_item->v.uint);
        if(1 != cb_item->v.uint) return;
    }
    cb_list = cn_cbor_mapget_string(cb, "list");
    if(cb_list) {
        filelistlength = cb_list->length;
        printf("FILE_UPDATE_AVAILABLE: list length = %d\n",filelistlength);
    }

    for(index=0;index<filelistlength;index++) {
        cb_item = cn_cbor_index(cb_list, index);

        if(cb_item) {
        	// File 'N'ame
            cb_file = cn_cbor_mapget_string(cb_item, "N");
            if(cb_file) {
            	strncpy(incomingFilename,cb_file->v.str, MAX_INCOMING_FILENAME_LENGTH);
            	if((unsigned int)cb_file->length < MAX_INCOMING_FILENAME_LENGTH) incomingFilename[cb_file->length] = '\0';
            	incomingFilename[MAX_INCOMING_FILENAME_LENGTH-1] = '\0';
            } else {
                printf("No key called N\n");
            }

            // File 'R'evision
            cb_file = cn_cbor_mapget_string(cb_item, "R");
            if(cb_file)
            {
                strncpy( download_context.file_revision, cb_file->v.str, sizeof( download_context.file_revision ) );
                if( (unsigned int) cb_file->length < sizeof( download_context.file_revision ) )
                {
                    download_context.file_revision[cb_file->length] = '\0';
                }
                download_context.file_revision[sizeof(download_context.file_revision)-1] = '\0';
            }
            else
            {
                printf("No key called R\n");
            }

            // File 'S'ize
            cb_file = cn_cbor_mapget_string(cb_item, "S");
            if(cb_file) {
                printf("FILE_UPDATE_AVAILABLE: file length = %d\n",cb_file->v.sint);
                download_context.file_length = cb_file->v.sint;
                tenpercent = download_context.file_length / 10;
                currenttenpercent = tenpercent;
                printf("Filelength %d\n",download_context.file_length);
            } else {
                printf("No key called S\n");
            }

            // File 'F'ingerprint
            cb_file = cn_cbor_mapget_string(cb_item, "F");
            if(cb_file)
            {
                for(i=0;i<32;i++)
                {
                    download_context.file_sft_fingerprint[i] = cb_file->v.str[i];
                }

                printf("FILE_UPDATE_AVAILABLE: file fingerprint = 0x");
                for(i=0;i<32;i++)
                {
                    printf("%02x",download_context.file_sft_fingerprint[i] );
                }
                printf("\n");
            } else {
                printf("No key called F\n");
            }

        } else {
            printf("No item at index %d\n",i);
        }
    }
    printf( "\n" );
    printf( "xi_parse_file_update_available { name: \"%s\", revision: \"%s\"}\n", incomingFilename, download_context.file_revision );
    printf( "\n" );

    /* Let's try making a GET_CHUNK packet */
    printf("File chunk request params:\n");
    int messageType = XI_FILE_GET_CHUNK;
    int messageVersion = 1;
    int offset = 0;
    int messageLength = 1024;
    printf("msgtype: %d\n", messageType);
    printf("msgver: %d\n", messageVersion);
    printf("N: \"%s\"\n", incomingFilename);
    printf("R: \"%s\"\n", download_context.file_revision );
    printf("O: %d\n", offset);
    printf("L: %d\n", messageLength);

    cn_cbor_errback err;
    cn_cbor *cb_map = cn_cbor_map_create(&err);

    int cbor_status = XI_CBOR_PARSER_OK;
    cbor_status &= cn_cbor_map_put(cb_map,
                    cn_cbor_string_create("msgtype", &err),
                    cn_cbor_int_create(messageType, &err), &err);

    cbor_status &= cn_cbor_map_put(cb_map,
                    cn_cbor_string_create("msgver", &err),
                    cn_cbor_int_create(messageVersion, &err), &err);

    cbor_status &= cn_cbor_map_put(cb_map,
                    cn_cbor_string_create("N", &err),
                    cn_cbor_string_create(incomingFilename, &err),
                    &err);
    cbor_status &= cn_cbor_map_put(cb_map,
                    cn_cbor_string_create("R", &err),
                    cn_cbor_string_create( download_context.file_revision, &err),
                    &err);
    cbor_status &= cn_cbor_map_put(cb_map,
                    cn_cbor_string_create("O", &err),
                    cn_cbor_int_create(offset, &err), &err);
    cbor_status &= cn_cbor_map_put(cb_map,
                    cn_cbor_string_create("L", &err),
                    cn_cbor_int_create(messageLength, &err), &err);

    printf("cbor status: %d\n", cbor_status );
    enc_sz = cn_cbor_encoder_write(encoded, 0, sizeof(encoded), cb_map);
    cn_cbor_free(cb_map CBOR_CONTEXT_PARAM);
}

