xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
int xi_parse_file_chunk(cn_cbor* in_cb, xi_sft_file_chunk_t* out_sft_file_chunk )
{
    if( NULL == in_cb || NULL == out_sft_file_chunk )
    {
        return -1;
    }

    static ledToggle = 0;
    ledToggle = ( ledToggle + 1 ) % 2;
    if( ledToggle )
    {
        GPIO_IF_LedOn( MCU_RED_LED_GPIO );
    }
    else
    {
        GPIO_IF_LedOff( MCU_RED_LED_GPIO );
    }

    cn_cbor *cb_item = NULL;
    memset( out_sft_file_chunk, 0, sizeof(xi_sft_file_chunk_t) );

    //
    // msg version
    //
    cb_item = cn_cbor_mapget_string( in_cb, "msgver" );
    if(cb_item)
    {
        if( 1 != cb_item->v.uint )
        {
            printf( "FILE_CHUNK unsupported message version: %d\n", cb_item->v.uint );
            return -1;
        }
    }
    else
    {
       printf( "FILE_CHUNK message missing message version field\n" );
       return -1;
    }

    //
    // chunk offset
    //
    cb_item = cn_cbor_mapget_string( in_cb, "O" );
    if( cb_item )
    {
       out_sft_file_chunk->offset = cb_item->v.uint;
    }
    else
    {
        printf("FILE_CHUNK message missing offset field\n");
        return -1;
    }

    //
    // chunk length
    //
    cb_item = cn_cbor_mapget_string( in_cb, "L" );
    if( cb_item )
    {
        out_sft_file_chunk->chunk_length = cb_item->v.uint;
    }
    else
    {
        printf( "FILE_CHUNK message missing length field\n" );
        return -1;
    }

    //
    // Status
    //
    cb_item = cn_cbor_mapget_string( in_cb, "S" );
    if( cb_item )
    {
        out_sft_file_chunk->status = cb_item->v.uint;
    }
    else
    {
        printf( "FILE_CHUNK message missing status field\n" );
        return -1;
    }

    //
    // Byte Array
    //
    cb_item = cn_cbor_mapget_string( in_cb, "C" );
    if(cb_item)
    {
        out_sft_file_chunk->array_length = cb_item->length;
        out_sft_file_chunk->byte_array = (unsigned char *)cb_item->v.str;
    }
    else
    {
        printf( "FILE_CHUNK message missing byte array field\n" );
    }

    return 0;
}

int total_messages = 0;

void xi_process_file_chunk( cn_cbor *cb )
{
    cn_cbor *cb_item;
    unsigned chunkoffset = 0;
    int retval;

    xi_sft_file_chunk_t file_chunk_data;
    if( 0 != xi_parse_file_chunk( cb, &file_chunk_data ) )
    {
        downloading = 0;
        return;
    }

    printf( "---- FILE_CHUNK: length = %d FILE_LENGTH: %d\n", file_chunk_data.chunk_length, download_context.file_length );

    // Save the offset for THIS fine chunk
    chunkoffset = offset;

    // Build the offset for the NEXT file chunk
    offset += file_chunk_data.chunk_length;

    if(currenttenpercent < offset)
    {
        /* Yes, I know this is terrible, but it's the level of effort appropriate to the task. */
        printf("Downloaded %d bytes %d %%  of the file \n",offset, (100 * (currenttenpercent + 1000)) / download_context.file_length );
        currenttenpercent += tenpercent;
    }

    printf("cb_item->length = %d\r\n", file_chunk_data.array_length);

    if( file_chunk_data.array_length )
    {
        int writelength = file_chunk_data.array_length;
        if( chunkoffset + file_chunk_data.array_length > download_context.file_length )
        {
            writelength = download_context.file_length - chunkoffset ;
            downloading = 0;
        }

        sha256_update( &download_context.sha256_context, (unsigned char *) file_chunk_data.byte_array, file_chunk_data.array_length );
        retval = sl_extlib_FlcWriteFile( download_context.file_token, chunkoffset, (unsigned char *) file_chunk_data.byte_array, file_chunk_data.array_length );
        if( retval < file_chunk_data.array_length )
        {
            downloading = 0;
            //sl_extlib_FlcCloseFile(lFileHandle, NULL, NULL, 0);
        }

        printf("Write returned %d\n",retval);

        if( (chunkoffset + file_chunk_data.array_length ) >= download_context.file_length )
        {
            printf("Downloaded is done\n");
            downloading = 0;
        }
    }
    else
    {
        downloading = 0;
        //sl_extlib_FlcCloseFile(lFileHandle, NULL, NULL, 0);
    }


    if(cb_item->v.uint > 1)
    {
        downloading = 0;
        	sl_extlib_FlcCloseFile( download_context.file_token, NULL, NULL, 0 );
    }

#if 1
    printf("File chunk request params:\n");
    int messageType = XI_FILE_GET_CHUNK;
    int messageVersion = 1;
    int messageLength = 1024;
    printf( "msgtype: %d\n", messageType );
    printf( "msgver: %d\n", messageVersion );
    printf( "N: \"%s\"\n", incomingFilename );
    printf( "R: \"%s\"\n", download_context.file_revision );
    printf( "O: %d\n", offset );
    printf( "L: %d\n", messageLength );
#endif

#if 1
    printf( "internal downloading: %d\n", downloading );
    if(1 == downloading) {
		/* Let's try making a GET_CHUNK packet */
        printf("creating get_chunk packet\n");
		cn_cbor_errback err;
		cn_cbor *cb_map = cn_cbor_map_create(&err);

		cn_cbor_map_put(cb_map,
						cn_cbor_string_create("msgtype", &err),
						cn_cbor_int_create(messageType, &err), &err);

		cn_cbor_map_put(cb_map,
						cn_cbor_string_create("msgver", &err),
						cn_cbor_int_create(messageVersion, &err), &err);
		cn_cbor_map_put(cb_map,
						cn_cbor_string_create("N", &err),
						cn_cbor_string_create(incomingFilename, &err),
						&err);
		cn_cbor_map_put(cb_map,
						cn_cbor_string_create("R", &err),
						cn_cbor_string_create( download_context.file_revision, &err),
						&err);
		cn_cbor_map_put(cb_map,
						cn_cbor_string_create("O", &err),
						cn_cbor_int_create(offset, &err), &err);
		cn_cbor_map_put(cb_map,
						cn_cbor_string_create("L", &err),
						cn_cbor_int_create(messageLength, &err), &err);

		enc_sz = cn_cbor_encoder_write(encoded, 0, sizeof(encoded), cb_map);
		cn_cbor_free(cb_map CBOR_CONTEXT_PARAM);
    }
#endif
}

int
xi_sft_init(xi_context_handle_t in_context_handle, char *account_id, char *device_id) {
	int r = -1;

	readBootinfo();
	// Accept the latest firmware if we get here.
	if( sl_extlib_FlcIsPendingCommit() )
	{
	    printf("******************* Committing this revision\n");
	    sl_extlib_FlcCommit(FLC_COMMITED);
	}

	readBootinfo();

